{
  "New Direction": {
    "raised": 2887760,
    "note": "New Direction is funded by three primary donors: two Democratic PACs (the Truman Fund and the Kennedy Fund) and Dime PAC. It has spent over $400,000 (so far) attacking Republican state Senate candidates Steve Litzow and Lynda Wilson. "
  },
  "Kennedy Fund": {
    "raised": 1555627,
    "note": "The top three donors to the Kennedy Fund are SEIU Washington State Council, SEIU Local 775 and SEIU Local 1199."
  },
  "Truman Fund": {
    "raised": 2716894,
    "note": "Like the Kennedy Fund, the Truman Fund counts unions as its top donors, with the Washington Education Association, SEIU Washington State Council, and SEIU Locals 775 and 1199 leading the way."
  },
  "Dime PAC": {
    "raised": 191956,
    "note": "Dime PAC is organized by the Washington State Labor Council."
  },
  "SEIU 775": {},
  "SEIU Washington State Council": {},
  "Washington Indian Gaming Association": {},
  "Justice for All": {
    "raised": 358146,
    "note": "Justice For All is listed with the state Public Disclosure Commission under \"Washington State Association for Justice,\" and its top donors are lawyers."
  },
  "Washington Education Association": {},
  "SEIU 1199": {},
  "UFCW Local 21": {},
  "Washington Federation of State Employees": {},
  "IBEW": {},
  "Rebecca Roe": {},
  "Ralph Brindley": {},
  "Karen Koehler": {},
  "Tim Ford": {},
  "James Holman": {},
  "Working Families": {
    "raised": 800000,
    "note": "Working Families has spent $395,000 (so far) opposing State Sen. Mark Mullet (D-Issaquah). Its funding comes entirely from another PAC, the vaguely-named Leadership Council."
  },
  "The Leadership Council": {
    "raised": 2253290,
    "note": "The Leadership Council, in turn, counts as its top two donors the Republican State Leadership Committee (whose largest donor is the U.S. Chamber of Commerce) and Strat PAC."
  },
  "Republican State Leadership Committee": {
    "raised": 19100000,
    "note": "The U.S. Chamber does not disclose donors to its 501(c)6 non-profit, which places it in the category of \"dark money,\" so the trail ends here."
  },
  "Strat PAC": {
    "raised": 105902,
    "note": "Strat PAC is funded by debt collection companies."
  },
  "Dynamic Collectors": {},
  "Merchants Credit Association": {},
  "Washington Collectors Tri-cities": {},
  "U.S. Chamber of Commerce": {}
}