{
  "New Direction": {
    "raised": 1305000,
    "note": "New Direction is funded by three primary donors: two presidentially-named funds, and Dime PAC."
  },
  "Kennedy Fund": {
    "raised": 1264128,
    "note": "In addition to unions and tribes, Kennedy gets its donations from a PAC named Justice for All."
  },
  "Truman Fund": {
    "raised": 2125894,
    "note": "Like the Kennedy Fund, the Truman Fund gets most of its donations from unions, including those representing service industry workers, teachers and state employees."
  },
  "Dime PAC": {
    "raised": 432426,
    "note": "Dime PAC is organized by the Washington State Labor Council."
  },
  "SEIU 775": {},
  "SEIU Washington State Council": {},
  "Washington Indian Gaming Association": {},
  "Justice for All": {
    "raised": 990133,
    "note": "Justice For All is listed with the state Public Disclosure Commission under \"Washington State Association for Justice,\" and its top donors are lawyers."
  },
  "Washington Education Association": {},
  "SEIU 1199": {},
  "UFCW Local 21": {},
  "Washington Federation of State Employees": {},
  "IBEW": {},
  "Rebecca Roe": {},
  "Ralph Brindley": {},
  "Karen Koehler": {},
  "Tim Ford": {},
  "James Holman": {},
  "Working Families": {
    "raised": 450135,
    "note": "Working Families has spent $337,000 (so far) opposing State Sen. Mark Millet (D-Issaquah). Its funding comes entirely from another PAC, the vaguely-named Leadership Council."
  },
  "The Leadership Council": {
    "raised": 1115445,
    "note": "The Leadership Council, in turn, counts as its top two donors the Republican State Leadership Committee (whose largest donor is the US Chamber of Commerce) and Strat PAC."
  },
  "Republican State Leadership Committee": {
    "raised": 19100000,
    "note": "The US Chamber does not disclose donors to its 501(c)6 non-profit, which places it in the category of \"dark money,\" so the trail ends here."
  },
  "Strat PAC": {
    "raised": 105000,
    "note": "Strat PAC is funded by debt collection companies."
  },
  "Dynamic Collectors": {},
  "Merchants Credit Association": {},
  "Washington Collectors Tri-cities": {},
  "US Chamber of Commerce": {}
}